; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l35_p35_c35_g35_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(at crate32 depot)
	(at crate33 depot)
	(at crate34 depot)
	(at crate35 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 food)
	(crate-content crate23 food)
	(crate-content crate24 food)
	(crate-content crate25 food)
	(crate-content crate26 food)
	(crate-content crate27 food)
	(crate-content crate28 food)
	(crate-content crate29 food)
	(crate-content crate30 food)
	(crate-content crate31 food)
	(crate-content crate32 food)
	(crate-content crate33 food)
	(crate-content crate34 food)
	(crate-content crate35 medicine)
	(at person1 loc18)
	(at person2 loc6)
	(at person3 loc9)
	(at person4 loc34)
	(at person5 loc28)
	(at person6 loc17)
	(at person7 loc25)
	(at person8 loc5)
	(at person9 loc1)
	(at person10 loc24)
	(at person11 loc20)
	(at person12 loc6)
	(at person13 loc30)
	(at person14 loc13)
	(at person15 loc35)
	(at person16 loc9)
	(at person17 loc6)
	(at person18 loc20)
	(at person19 loc29)
	(at person20 loc17)
	(at person21 loc3)
	(at person22 loc16)
	(at person23 loc3)
	(at person24 loc21)
	(at person25 loc28)
	(at person26 loc15)
	(at person27 loc9)
	(at person28 loc11)
	(at person29 loc16)
	(at person30 loc6)
	(at person31 loc7)
	(at person32 loc20)
	(at person33 loc32)
	(at person34 loc8)
	(at person35 loc15)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person5 food)
	(person-needs person6 food)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person23 food)
	(person-needs person24 food)
	(person-needs person25 food)
	(person-needs person26 food)
	(person-needs person27 food)
	(person-needs person28 food)
	(person-needs person29 food)
	(person-needs person30 food)
	(person-needs person31 food)
	(person-needs person32 food)
	(person-needs person33 food)
	(person-needs person34 food)
	(person-needs person34 medicine)
	(person-needs person35 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person23 food)
	(person-has person24 food)
	(person-has person25 food)
	(person-has person26 food)
	(person-has person27 food)
	(person-has person28 food)
	(person-has person29 food)
	(person-has person30 food)
	(person-has person31 food)
	(person-has person32 food)
	(person-has person33 food)
	(person-has person34 food)
	(person-has person34 medicine)
	(person-has person35 food)
	))
)

; plan
1. (grab-arm2 drone1 crate35 depot)
   deleted: (arm2-free drone1) (at crate35 depot)
   added: (arm2-load drone1 crate35)
   goals met: 1 of 36
2. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 0 of 36
3. (deliver-arm2 drone1 person34 crate35 medicine loc8)
   deleted: (arm2-load drone1 crate35) (person-needs person34 medicine)
   added: (arm2-free drone1) (person-has person34 medicine)
   goals met: 1 of 36
4. (move-drone drone1 loc8 loc7)
   deleted: (at drone1 loc8)
   added: (at drone1 loc7)
   goals met: 1 of 36
5. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 2 of 36
6. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 2 of 36
7. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 2 of 36
8. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 1 of 36
9. (move-drone drone1 loc21 loc6)
   deleted: (at drone1 loc21)
   added: (at drone1 loc6)
   goals met: 1 of 36
10. (deliver-arm2 drone1 person2 crate18 food loc6)
   deleted: (arm2-load drone1 crate18) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 2 of 36
11. (move-drone drone1 loc6 loc9)
   deleted: (at drone1 loc6)
   added: (at drone1 loc9)
   goals met: 2 of 36
12. (deliver-arm1 drone1 person3 crate5 food loc9)
   deleted: (arm1-load drone1 crate5) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 3 of 36
13. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 4 of 36
14. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 4 of 36
15. (move-drone drone1 depot loc34)
   deleted: (at drone1 depot)
   added: (at drone1 loc34)
   goals met: 3 of 36
16. (deliver-arm2 drone1 person4 crate17 food loc34)
   deleted: (arm2-load drone1 crate17) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 4 of 36
17. (move-drone drone1 loc34 depot)
   deleted: (at drone1 loc34)
   added: (at drone1 depot)
   goals met: 5 of 36
18. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 5 of 36
19. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 4 of 36
20. (deliver-arm2 drone1 person5 crate7 food loc28)
   deleted: (arm2-load drone1 crate7) (person-needs person5 food)
   added: (arm2-free drone1) (person-has person5 food)
   goals met: 5 of 36
21. (move-drone drone1 loc28 depot)
   deleted: (at drone1 loc28)
   added: (at drone1 depot)
   goals met: 6 of 36
22. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 6 of 36
23. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 6 of 36
24. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 5 of 36
25. (deliver-arm2 drone1 person6 crate11 food loc17)
   deleted: (arm2-load drone1 crate11) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 6 of 36
26. (move-drone drone1 loc17 loc25)
   deleted: (at drone1 loc17)
   added: (at drone1 loc25)
   goals met: 6 of 36
27. (deliver-arm1 drone1 person7 crate21 food loc25)
   deleted: (arm1-load drone1 crate21) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 7 of 36
28. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 8 of 36
29. (grab-arm2 drone1 crate31 depot)
   deleted: (arm2-free drone1) (at crate31 depot)
   added: (arm2-load drone1 crate31)
   goals met: 8 of 36
30. (grab-arm1 drone1 crate28 depot)
   deleted: (arm1-free drone1) (at crate28 depot)
   added: (arm1-load drone1 crate28)
   goals met: 8 of 36
31. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 7 of 36
32. (deliver-arm2 drone1 person8 crate31 food loc5)
   deleted: (arm2-load drone1 crate31) (person-needs person8 food)
   added: (arm2-free drone1) (person-has person8 food)
   goals met: 8 of 36
33. (move-drone drone1 loc5 loc1)
   deleted: (at drone1 loc5)
   added: (at drone1 loc1)
   goals met: 8 of 36
34. (deliver-arm1 drone1 person9 crate28 food loc1)
   deleted: (arm1-load drone1 crate28) (person-needs person9 food)
   added: (arm1-free drone1) (person-has person9 food)
   goals met: 9 of 36
35. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 10 of 36
36. (grab-arm1 drone1 crate32 depot)
   deleted: (arm1-free drone1) (at crate32 depot)
   added: (arm1-load drone1 crate32)
   goals met: 10 of 36
37. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 10 of 36
38. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 9 of 36
39. (deliver-arm1 drone1 person10 crate32 food loc24)
   deleted: (arm1-load drone1 crate32) (person-needs person10 food)
   added: (arm1-free drone1) (person-has person10 food)
   goals met: 10 of 36
40. (move-drone drone1 loc24 loc20)
   deleted: (at drone1 loc24)
   added: (at drone1 loc20)
   goals met: 10 of 36
41. (deliver-arm2 drone1 person11 crate23 food loc20)
   deleted: (arm2-load drone1 crate23) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 11 of 36
42. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 12 of 36
43. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 12 of 36
44. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 11 of 36
45. (deliver-arm1 drone1 person12 crate12 food loc6)
   deleted: (arm1-load drone1 crate12) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 12 of 36
46. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 13 of 36
47. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 13 of 36
48. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 13 of 36
49. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 12 of 36
50. (deliver-arm1 drone1 person13 crate27 food loc30)
   deleted: (arm1-load drone1 crate27) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 13 of 36
51. (move-drone drone1 loc30 loc9)
   deleted: (at drone1 loc30)
   added: (at drone1 loc9)
   goals met: 13 of 36
52. (deliver-arm2 drone1 person27 crate3 food loc9)
   deleted: (arm2-load drone1 crate3) (person-needs person27 food)
   added: (arm2-free drone1) (person-has person27 food)
   goals met: 14 of 36
53. (move-drone drone1 loc9 loc13)
   deleted: (at drone1 loc9)
   added: (at drone1 loc13)
   goals met: 14 of 36
54. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 15 of 36
55. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 15 of 36
56. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 14 of 36
57. (move-drone drone1 loc30 loc35)
   deleted: (at drone1 loc30)
   added: (at drone1 loc35)
   goals met: 14 of 36
58. (deliver-arm1 drone1 person15 crate6 food loc35)
   deleted: (arm1-load drone1 crate6) (person-needs person15 food)
   added: (arm1-free drone1) (person-has person15 food)
   goals met: 15 of 36
59. (move-drone drone1 loc35 depot)
   deleted: (at drone1 loc35)
   added: (at drone1 depot)
   goals met: 16 of 36
60. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 16 of 36
61. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 16 of 36
62. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 15 of 36
63. (deliver-arm1 drone1 person16 crate15 food loc9)
   deleted: (arm1-load drone1 crate15) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 16 of 36
64. (move-drone drone1 loc9 loc6)
   deleted: (at drone1 loc9)
   added: (at drone1 loc6)
   goals met: 16 of 36
65. (deliver-arm2 drone1 person17 crate14 food loc6)
   deleted: (arm2-load drone1 crate14) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 17 of 36
66. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 18 of 36
67. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 18 of 36
68. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 18 of 36
69. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 17 of 36
70. (deliver-arm2 drone1 person18 crate13 food loc20)
   deleted: (arm2-load drone1 crate13) (person-needs person18 food)
   added: (arm2-free drone1) (person-has person18 food)
   goals met: 18 of 36
71. (move-drone drone1 loc20 loc29)
   deleted: (at drone1 loc20)
   added: (at drone1 loc29)
   goals met: 18 of 36
72. (deliver-arm1 drone1 person19 crate1 food loc29)
   deleted: (arm1-load drone1 crate1) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 19 of 36
73. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 20 of 36
74. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 20 of 36
75. (grab-arm2 drone1 crate34 depot)
   deleted: (arm2-free drone1) (at crate34 depot)
   added: (arm2-load drone1 crate34)
   goals met: 20 of 36
76. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 19 of 36
77. (deliver-arm1 drone1 person20 crate20 food loc17)
   deleted: (arm1-load drone1 crate20) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 20 of 36
78. (move-drone drone1 loc17 loc3)
   deleted: (at drone1 loc17)
   added: (at drone1 loc3)
   goals met: 20 of 36
79. (deliver-arm2 drone1 person21 crate34 food loc3)
   deleted: (arm2-load drone1 crate34) (person-needs person21 food)
   added: (arm2-free drone1) (person-has person21 food)
   goals met: 21 of 36
80. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 22 of 36
81. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 22 of 36
82. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 21 of 36
83. (deliver-arm2 drone1 person23 crate26 food loc3)
   deleted: (arm2-load drone1 crate26) (person-needs person23 food)
   added: (arm2-free drone1) (person-has person23 food)
   goals met: 22 of 36
84. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 23 of 36
85. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 23 of 36
86. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 22 of 36
87. (deliver-arm2 drone1 person24 crate4 food loc21)
   deleted: (arm2-load drone1 crate4) (person-needs person24 food)
   added: (arm2-free drone1) (person-has person24 food)
   goals met: 23 of 36
88. (move-drone drone1 loc21 loc26)
   deleted: (at drone1 loc21)
   added: (at drone1 loc26)
   goals met: 23 of 36
89. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 24 of 36
90. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 24 of 36
91. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 24 of 36
92. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 23 of 36
93. (deliver-arm2 drone1 person25 crate16 food loc28)
   deleted: (arm2-load drone1 crate16) (person-needs person25 food)
   added: (arm2-free drone1) (person-has person25 food)
   goals met: 24 of 36
94. (move-drone drone1 loc28 loc15)
   deleted: (at drone1 loc28)
   added: (at drone1 loc15)
   goals met: 24 of 36
95. (deliver-arm1 drone1 person26 crate19 food loc15)
   deleted: (arm1-load drone1 crate19) (person-needs person26 food)
   added: (arm1-free drone1) (person-has person26 food)
   goals met: 25 of 36
96. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 26 of 36
97. (grab-arm1 drone1 crate29 depot)
   deleted: (arm1-free drone1) (at crate29 depot)
   added: (arm1-load drone1 crate29)
   goals met: 26 of 36
98. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 25 of 36
99. (deliver-arm1 drone1 person14 crate29 food loc13)
   deleted: (arm1-load drone1 crate29) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 26 of 36
100. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 27 of 36
101. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 27 of 36
102. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 26 of 36
103. (deliver-arm1 drone1 person28 crate8 food loc11)
   deleted: (arm1-load drone1 crate8) (person-needs person28 food)
   added: (arm1-free drone1) (person-has person28 food)
   goals met: 27 of 36
104. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 28 of 36
105. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 28 of 36
106. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 27 of 36
107. (deliver-arm1 drone1 person29 crate22 food loc16)
   deleted: (arm1-load drone1 crate22) (person-needs person29 food)
   added: (arm1-free drone1) (person-has person29 food)
   goals met: 28 of 36
108. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 29 of 36
109. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 29 of 36
110. (grab-arm2 drone1 crate24 depot)
   deleted: (arm2-free drone1) (at crate24 depot)
   added: (arm2-load drone1 crate24)
   goals met: 29 of 36
111. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 28 of 36
112. (deliver-arm1 drone1 person30 crate2 food loc6)
   deleted: (arm1-load drone1 crate2) (person-needs person30 food)
   added: (arm1-free drone1) (person-has person30 food)
   goals met: 29 of 36
113. (move-drone drone1 loc6 loc7)
   deleted: (at drone1 loc6)
   added: (at drone1 loc7)
   goals met: 29 of 36
114. (deliver-arm2 drone1 person31 crate24 food loc7)
   deleted: (arm2-load drone1 crate24) (person-needs person31 food)
   added: (arm2-free drone1) (person-has person31 food)
   goals met: 30 of 36
115. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 31 of 36
116. (grab-arm1 drone1 crate30 depot)
   deleted: (arm1-free drone1) (at crate30 depot)
   added: (arm1-load drone1 crate30)
   goals met: 31 of 36
117. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 31 of 36
118. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 30 of 36
119. (move-drone drone1 loc8 loc20)
   deleted: (at drone1 loc8)
   added: (at drone1 loc20)
   goals met: 30 of 36
120. (deliver-arm1 drone1 person32 crate30 food loc20)
   deleted: (arm1-load drone1 crate30) (person-needs person32 food)
   added: (arm1-free drone1) (person-has person32 food)
   goals met: 31 of 36
121. (move-drone drone1 loc20 loc32)
   deleted: (at drone1 loc20)
   added: (at drone1 loc32)
   goals met: 31 of 36
122. (deliver-arm2 drone1 person33 crate9 food loc32)
   deleted: (arm2-load drone1 crate9) (person-needs person33 food)
   added: (arm2-free drone1) (person-has person33 food)
   goals met: 32 of 36
123. (move-drone drone1 loc32 depot)
   deleted: (at drone1 loc32)
   added: (at drone1 depot)
   goals met: 33 of 36
124. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 33 of 36
125. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 32 of 36
126. (deliver-arm1 drone1 person34 crate25 food loc8)
   deleted: (arm1-load drone1 crate25) (person-needs person34 food)
   added: (arm1-free drone1) (person-has person34 food)
   goals met: 33 of 36
127. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 34 of 36
128. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 34 of 36
129. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 33 of 36
130. (deliver-arm1 drone1 person1 crate10 food loc18)
   deleted: (arm1-load drone1 crate10) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 34 of 36
131. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 35 of 36
132. (grab-arm1 drone1 crate33 depot)
   deleted: (arm1-free drone1) (at crate33 depot)
   added: (arm1-load drone1 crate33)
   goals met: 35 of 36
133. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 34 of 36
134. (move-drone drone1 loc20 loc15)
   deleted: (at drone1 loc20)
   added: (at drone1 loc15)
   goals met: 34 of 36
135. (deliver-arm1 drone1 person35 crate33 food loc15)
   deleted: (arm1-load drone1 crate33) (person-needs person35 food)
   added: (arm1-free drone1) (person-has person35 food)
   goals met: 35 of 36
136. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 36 of 36
